---
type: RibbonPanel
namespace: Autodesk.Revit.UI
version: 2024
members: 10
tags: [revit-api, class]
---

# RibbonPanel

`Autodesk.Revit.UI.RibbonPanel` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddItem | 2011 | `public RibbonItem AddItem ( RibbonItemData itemData )` |
| Method | AddSeparator | — | `public void AddSeparator ()` |
| Method | AddSlideOut | 2011 | `public void AddSlideOut ()` |
| Method | AddStackedItems | — | `` |
| Method | Equals | — | `public override bool Equals ( Object obj )` |
| Method | GetItems | — | `public IList < RibbonItem > GetItems ()` |
| Property | Enabled | — | `public bool Enabled { get ; set ; }` |
| Property | Name | — | `public string Name { get ; set ; }` |
| Property | Title | — | `public string Title { get ; set ; }` |
| Property | Visible | — | `public bool Visible { get ; set ; }` |